## Ordinal number Encoding

In [1]:
import pandas as pd
import numpy as np
import datetime

In [2]:
today_date=datetime.datetime.today()
today_date

datetime.datetime(2021, 6, 3, 1, 47, 35, 345371)

In [3]:
today_date-datetime.timedelta(1)

datetime.datetime(2021, 6, 2, 1, 47, 35, 345371)

In [4]:
## we are have past 15 days record incuding today
[today_date-datetime.timedelta(x) for x in range(0,15)]

[datetime.datetime(2021, 6, 3, 1, 47, 35, 345371),
 datetime.datetime(2021, 6, 2, 1, 47, 35, 345371),
 datetime.datetime(2021, 6, 1, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 31, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 30, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 29, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 28, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 27, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 26, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 25, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 24, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 23, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 22, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 21, 1, 47, 35, 345371),
 datetime.datetime(2021, 5, 20, 1, 47, 35, 345371)]

In [5]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [6]:
df=pd.DataFrame(days)
df.columns=['Day']
df

                          Day
0  2021-06-03 01:47:35.345371
1  2021-06-02 01:47:35.345371
2  2021-06-01 01:47:35.345371
3  2021-05-31 01:47:35.345371
4  2021-05-30 01:47:35.345371
5  2021-05-29 01:47:35.345371
6  2021-05-28 01:47:35.345371
7  2021-05-27 01:47:35.345371
8  2021-05-26 01:47:35.345371
9  2021-05-25 01:47:35.345371
10 2021-05-24 01:47:35.345371
11 2021-05-23 01:47:35.345371
12 2021-05-22 01:47:35.345371
13 2021-05-21 01:47:35.345371
14 2021-05-20 01:47:35.345371

In [7]:
df['Day'].dt.day_name()

0      Thursday
1     Wednesday
2       Tuesday
3        Monday
4        Sunday
5      Saturday
6        Friday
7      Thursday
8     Wednesday
9       Tuesday
10       Monday
11       Sunday
12     Saturday
13       Friday
14     Thursday
Name: Day, dtype: object

In [8]:
df['weekday']=df['Day'].dt.day_name()

In [9]:
df.head()

                         Day    weekday
0 2021-06-03 01:47:35.345371   Thursday
1 2021-06-02 01:47:35.345371  Wednesday
2 2021-06-01 01:47:35.345371    Tuesday
3 2021-05-31 01:47:35.345371     Monday
4 2021-05-30 01:47:35.345371     Sunday

In [10]:
Day_rank={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [11]:
Day_rank

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [12]:
df['weekday'].map(Day_rank)

0     4
1     3
2     2
3     1
4     7
5     6
6     5
7     4
8     3
9     2
10    1
11    7
12    6
13    5
14    4
Name: weekday, dtype: int64

In [13]:
df.head()

                         Day    weekday
0 2021-06-03 01:47:35.345371   Thursday
1 2021-06-02 01:47:35.345371  Wednesday
2 2021-06-01 01:47:35.345371    Tuesday
3 2021-05-31 01:47:35.345371     Monday
4 2021-05-30 01:47:35.345371     Sunday

In [14]:
df['weekday_ordinal']=df['weekday'].map(Day_rank)
df.head()

                         Day    weekday  weekday_ordinal
0 2021-06-03 01:47:35.345371   Thursday                4
1 2021-06-02 01:47:35.345371  Wednesday                3
2 2021-06-01 01:47:35.345371    Tuesday                2
3 2021-05-31 01:47:35.345371     Monday                1
4 2021-05-30 01:47:35.345371     Sunday                7

### Count or Frequency encoding

In [15]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [16]:
train_set.shape

(32561, 15)

In [17]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [18]:
columns=[1,3,5,6,7,8,9,13]

In [19]:
train_set[columns]

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [20]:
train_set=train_set[columns]

In [21]:
train_set.columns=['Employment','Education','Status','profession','family_role','Race','Sex','Country']

In [22]:
train_set.head()

,Employment,Education,Status,profession,family_role,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [23]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Education : 16 labels
Status : 7 labels
profession : 15 labels
family_role : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [24]:
train_set['Country'].value_counts().to_dict()

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' Greece': 29,
 ' France': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Trinadad&Tobago': 19,
 ' Cambodia': 19,
 ' Thailand': 18,
 ' Laos': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [25]:
country_map=train_set['Country'].value_counts().to_dict()

In [26]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head(20)

,Employment,Education,Status,profession,family_role,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

##### Advantages
1. Easy To Use
2. Not increasing feature space 

##### Disadvantages
1. It will provide same weight if the frequencies are same

### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [27]:
df = pd.read_csv('Titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [45]:
df.shape

(891, 2)

In [28]:
df['Cabin'].fillna('Missing',inplace=True)

In [29]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [30]:
mis_cab=df.Cabin.value_counts().sort_values(ascending=False).index[0]

In [31]:
df2=df[df['Cabin']==mis_cab]

In [32]:
df2.head()

   Survived    Cabin
0         0  Missing
2         1  Missing
4         0  Missing
5         0  Missing
7         0  Missing

In [43]:
## here we can see not survived are having higher Missing values
df2.groupby('Survived')['Cabin'].count()

Survived
0    481
1    206
Name: Cabin, dtype: int64

In [35]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [38]:
## We are converting first letters of cabin category
df['Cabin']=df['Cabin'].astype(str).str[0]

In [39]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [41]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [49]:
## Count of person in each cabin M is missing value
df.groupby('Cabin')['Survived'].count()

Cabin
A     15
B     47
C     59
D     33
E     32
F     13
G      4
M    687
T      1
Name: Survived, dtype: int64

In [48]:
## Probability of person suviving
df.groupby('Cabin')['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [52]:
df.groupby('Cabin')['Survived'].mean().sort_values()

Cabin
T    0.000000
M    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [51]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [53]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [54]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [55]:
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

# Mean Encoding

In [56]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [57]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [58]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854